#!/usr/bin/python3

import random

def random_yishuv_name():
    first_names = ['נווה', 'מעלה', 'מבוא', 'בית', 'מצפה', 'כפר', 'מרום', 'קרית', 'הר',
                'אבני', 'ארץ', 'מגדל', 'גבעת', 'פרדס', 'זכרון', 'גני', 'נוף ', 'שערי', 'בת', 'נחלת']

    second_names = ['אילן', 'ברוש', 'ניצן', 'ניצנה', 'אביב', 'ירדן', 'שומרון', 'יהודה ', 'ים', 'ברכה',
                    'בראשית', 'מדבר', 'הנגב', 'גליל', 'גולן', 'מיכאל', 'יהושע', 'עוז', 'האלה', 'ארזים',
                    'זית', 'תמר', 'דגן', 'דקל', 'גפן', 'תאנה', 'רימון', 'נחלים', 'מאיר', 'עמוס', 'יואל',
                    'עובדיה', 'יונה', 'מיכה', 'נחום', 'חבקוק', 'זכריה', 'חגי ', 'צפניה', 'מלאכי', 'יעקב',
                    'בנימין', 'מנשה', 'אפרים', 'גלעד', 'תקווה', 'עזרא', 'נחמיה', 'חפץ', 'נפתלי ', 'מרדכי',
                    'צוף']

    first = random.choice(first_names)
    second = random.choice(second_names)

    name = f'{first} {second}'

    if random.randint(1, 10) == 10:
        name += ' עילית'

    return name